NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21B020F1024IM32.svd
        <register>
          <name>RXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F1F1F1F</resetMask>
          <fields>
            <field>
              <name>RXSETEVENT1</name>
              <description>First event that sets RX req signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Request is never set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Does not wait for any particular event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre counter overflow</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0UF</name>
                  <description>Timeout counter 0 underflow</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1UF</name>
                  <description>Timeout counter 1 underflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCH</name>
                  <description>Timeout counter 0 match</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1MATCH</name>
                  <description>Timeout counter 1 match</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Channel 0 Capture/Compare event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Channel 1 Capture/Compare event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Channel 2 Capture/Compare event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Channel 3 Capture/Compare event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC4</name>
                  <description>Channel 4 Capture/Compare event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDONE</name>
                  <description>MOD indicated that TX completed</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDONE</name>
                  <description>FRC indicated that RX completed</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXORRXDONE</name>
                  <description>MOD/FRC indicated that TX or RX completed</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0</name>
                  <description>DEMOD indicated that syncword 0 was detected</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET1</name>
                  <description>DEMOD indicated that syncword 1 was detected</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0OR1</name>
                  <description>DEMOD indicated that syncword 0 or 1 was detected</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTSUCCESS</name>
                  <description>LBT completed successfully</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTRETRY</name>
                  <description>LBT detected occupied channel and will try again</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTFAILURE</name>
                  <description>LBT could not start transmission</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANYLBT</name>
                  <description>Any LBT event</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCAACK</name>
                  <description>A CCA measurement completed</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA</name>
                  <description>A CCA measurement completed, and channel was clear</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTCCA</name>
                  <description>A CCA measurement completed, and channel was busy</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCHLBT</name>
                  <description>Timeout counter 0 match occurred during LBT operation</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXSETEVENT2</name>
              <description>Second event that sets RX req signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLREVENT1</name>
              <description>First event that clears RX req signal</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCLREVENT2</name>
              <description>Second event that clears RX req signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCTRL</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001F1F</resetMask>
          <fields>
            <field>
              <name>TXSETEVENT1</name>
              <description>First event that sets TX req signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Request is never set</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Does not wait for any particular event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRECNTOF</name>
                  <description>Pre counter overflow</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASECNTOF</name>
                  <description>Base counter overflow</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRAPCNTOF</name>
                  <description>Wrap counter overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0UF</name>
                  <description>Timeout counter 0 underflow</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1UF</name>
                  <description>Timeout counter 1 underflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCH</name>
                  <description>Timeout counter 0 match</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT1MATCH</name>
                  <description>Timeout counter 1 match</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC0</name>
                  <description>Channel 0 Capture/Compare event</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC1</name>
                  <description>Channel 1 Capture/Compare event</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC2</name>
                  <description>Channel 2 Capture/Compare event</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC3</name>
                  <description>Channel 3 Capture/Compare event</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CC4</name>
                  <description>Channel 4 Capture/Compare event</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDONE</name>
                  <description>MOD indicated that TX completed</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDONE</name>
                  <description>FRC indicated that RX completed</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXORRXDONE</name>
                  <description>MOD/FRC indicated that TX or RX completed</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0</name>
                  <description>DEMOD indicated that syncword 0 was detected</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET1</name>
                  <description>DEMOD indicated that syncword 1 was detected</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDET0OR1</name>
                  <description>DEMOD indicated that syncword 0 or 1 was detected</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTSUCCESS</name>
                  <description>LBT completed successfully</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTRETRY</name>
                  <description>LBT detected occupied channel and will try again</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBTFAILURE</name>
                  <description>LBT could not start transmission</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANYLBT</name>
                  <description>Any LBT event</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCAACK</name>
                  <description>A CCA measurement completed</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCA</name>
                  <description>A CCA measurement completed, and channel was clear</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOTCCA</name>
                  <description>A CCA measurement completed, and channel was busy</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOUT0MATCHLBT</name>
                  <description>Timeout counter 0 match occurred during LBT operation</description>
                  <value>27</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSETEVENT2</name>
              <description>Second event that sets TX req signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETSI</name>
          <description>No Description</description>
          <addressOffset>0x07C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <fields>
            <field>
              <name>ETSIEN</name>
              <description>ETSI LBT enabling</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GRANULARLESSTHANRXWARM</name>
              <description>Granular less than RXWARM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXWARMTHLD</name>
              <description>Minimum backoff period for RXWARM</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCAFIXED</name>
              <description>Fixed listening time</description>
              <bitOffset>10</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LBTSTATE1</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>CCACNT</name>
              <description>Current CCA counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXP</name>
              <description>LBT Exponent</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RETRYCNT</name>
              <description>LBT Retry counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDOMFW0</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM0</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANDOM1</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANDOM2</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDOMFW1</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FFFFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM3</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANDOM4</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANDOM5</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>18</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RANDOMFW2</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>RANDOM6</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANDOM7</name>
              <description>Linear random backoff period from FW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
